Autodesk.Revit.DB.FamilyManager.validateFamilySupportParamsOrder(FamilyBase!System.Runtime.CompilerServices.IsConst*)
Checks whether family supports parameters reorder and sort.

Autodesk.Revit.DB.FamilyManager.SortParameters(Autodesk.Revit.DB.ParametersOrder)
Sorts the family parameters according to the desired sort order.
order:
The desired sort order.
Remarks:
The sort only affects visible parameters within the same parameter group.
Parameters that belong to different groups will remain separated, and the groups' order will not be affected.
The sort is a one-time operation and when new parameters are added they will not be automatically sorted.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this family is a Rebar Shape family which doesn't support parameters reorder.
Since: 2015

Autodesk.Revit.DB.FamilyManager.IsUserAssignableParameterGroup(Autodesk.Revit.DB.BuiltInParameterGroup)
Checks if the given parameter group can be assigned to new parameters.
Returns:
True if the parameter group can be assigned to new parameters, false otherwise.
Since: 2015

Autodesk.Revit.DB.FamilyManager.ReorderParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.FamilyParameter})
Reorders the family parameters by the specified parameters order.
parameters:
The new parameters order for the family.
The contents of this collection should consist of exactly the same parameters returned by the GetParameters() method.
This will include invisible parameters; they can be reordered but this will have no effect when viewing the parameters in the Revit UI.
Remarks:
Reordering the parameters only affects visible parameters within the same parameter group.
Parameters that belong to different groups will remain separated, and the groups' order will not be affected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when argument is null or empty.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input parameters collection does not contain the same parameters as those returned by GetParameters().
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this family is a Rebar Shape family which doesn't support parameters reorder.
Since: 2015

Autodesk.Revit.DB.FamilyManager.GetParameters
Gets the parameters associated to family types in order.
Returns:
A collection containing all family parameters.
Remarks:
The parameters are family built-in parameters, category built-in parameters
and shared parameters associated to the family types.
The collection consists of both visible and invisible parameters associated to the family types.
The parameters are returned in the order in which they appear in the Revit UI within a given group;
however, parameters of different groups may be mixed within this output.
Currently the Revit UI order is determined first by group and next by the order of the individual parameters.
Since: 2015

Autodesk.Revit.DB.FamilyManager.SetParameterLocked(Autodesk.Revit.DB.FamilyParameter,System.Boolean)
For Conceptual Mass and Curtain Panel families,
lock or unlock a dimension-driving
parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this family is not a Conceptual Mass or
Curtain Panel family.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the parameter is not lockable.

Autodesk.Revit.DB.FamilyManager.IsParameterLocked(Autodesk.Revit.DB.FamilyParameter)
For Conceptual Mass and Curtain Panel families,
indicate whether the specified dimension-driving
parameter is locked.
Returns:
True if the parameter is lockable
and is locked; false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this family is not a Conceptual Mass or Curtain Panel family.

Autodesk.Revit.DB.FamilyManager.IsParameterLockable(Autodesk.Revit.DB.FamilyParameter)
For Conceptual Mass and Curtain Panel families,
indicate whether the specified parameter can be locked.
Returns:
True if the family is a Conceptual Mass or Curtain
Panel Family and the parameter drives one or more
dimensions; false otherwise.

Autodesk.Revit.DB.FamilyManager.GetAssociatedFamilyParameter(Autodesk.Revit.DB.Parameter)
Gets the associated family parameter of an element parameter.
elementParameter: The parameter of an element in family.
Returns: The associated family parameter if there is an association between them, returns null if not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"elementParameter"-is null.

Autodesk.Revit.DB.FamilyManager.CanElementParameterBeAssociated(Autodesk.Revit.DB.Parameter)
Indicates if this element parameter can be associated with a family parameter.

Autodesk.Revit.DB.FamilyManager.ReplaceParameter(Autodesk.Revit.DB.FamilyParameter,System.String,Autodesk.Revit.DB.BuiltInParameterGroup,System.Boolean)
Replace a shared family parameter with a new non-shared family parameter.
currentParameter: The current family parameter.
parameterName: The name of the new family parameter.
parameterGroup: The group to which the new family parameter belongs.
isInstance: Indicates if the new parameter is instance or type.
Returns: If replacement was successful the new family parameter is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"currentParameter" or "parameterName"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"currentParameter"-is invalid,
or the input parameter group cannot be assigned to the new parameter,
or the input name string contains illegal characters, or duplicated with existing parameter name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when trying to replace a built-in parameter or family parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when replacement failed, because the replacement would cause a formula error.
Or trying to replace with an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.ReplaceParameter(Autodesk.Revit.DB.FamilyParameter,Autodesk.Revit.DB.ExternalDefinition,Autodesk.Revit.DB.BuiltInParameterGroup,System.Boolean)
Replace a family parameter with a shared parameter.
currentParameter: The current family parameter.
familyDefinition: The definition of the loaded shared parameter.
parameterGroup: The group to which the new shared parameter belongs.
isInstance: Indicates if the new parameter is instance or type.
Returns: If replacement was successful the new shared parameter is returned,
otherwise an exception with failure information will be thrown.
Remarks: This operation is invalid for Built-in Parameters.
The formulas and labels which in reference to this parameter will be updated to the new parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter" or "name"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is invalid,
or the input parameter group cannot be assigned to the new parameter,
or the input name string contains illegal characters, or duplicated with existing parameter name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when trying to replace a built-in parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when replacement failed, because the replacement would cause a formula error.
Or trying to replace with an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.AssociateElementParameterToFamilyParameter(Autodesk.Revit.DB.Parameter,Autodesk.Revit.DB.FamilyParameter)
Associates or disassociates the element parameter to an existing family parameter.
elementParameter: The parameter of an element in family.
familyParameter: The existing family parameter. If the input to this argument is null,
it will disassociate the element parameter from any family parameters.
Remarks: The parameter types of these two input parameter should be same, if not an
exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"elementParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"elementParameter" or "familyParameter"-is an invalid parameter,
or the input argument-"elementParameter"-cannot be associated.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family parameter binding failed.

Autodesk.Revit.DB.FamilyManager.RenameParameter(Autodesk.Revit.DB.FamilyParameter,System.String)
Rename a family parameter.
familyParameter: The family parameter.
name: The new name.
Remarks: This operation is valid only for Family Parameters, and is invalid for Shared Parameters and Built-in Parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter" or "name"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is invalid,
or the input name string contains illegal characters, or duplicated with existing parameter name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when trying to rename a built-in parameter or shared parameter.

Autodesk.Revit.DB.FamilyManager.SetFormula(Autodesk.Revit.DB.FamilyParameter,System.String)
Set the formula of a family parameter.
familyParameter: The family parameter.
formula: The formula string, input null to clean the formula of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when there is no valid family type,
or the parameter cannot be assigned a formula,
or the operation make a circular chain of references among the formulas.

Autodesk.Revit.DB.FamilyManager.MakeNonReporting(Autodesk.Revit.DB.FamilyParameter)
Set the reporting family parameter as a regular/driving parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when attempting to make a parameter which is labeled to an arc length dimension non-reporting.
Since: 2011

Autodesk.Revit.DB.FamilyManager.MakeReporting(Autodesk.Revit.DB.FamilyParameter)
Set the family parameter as a reporting parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the parameter can not be changed to a reporting parameter.
Since: 2011

Autodesk.Revit.DB.FamilyManager.MakeType(Autodesk.Revit.DB.FamilyParameter)
Set the family parameter as a type parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.

Autodesk.Revit.DB.FamilyManager.MakeInstance(Autodesk.Revit.DB.FamilyParameter)
Set the family parameter as an instance parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when there is Type family parameter driven by this parameter.
Or trying to make a parameter of image type to instance.

Autodesk.Revit.DB.FamilyManager.RemoveParameter(Autodesk.Revit.DB.FamilyParameter)
Remove an existing family parameter from the family.
familyParameter: The family parameter.
Remarks: Only family and shared parameters may be removed, built-in
parameters may not be removed.
If the parameter is used in any formulas, those formulas will be
automatically removed along with the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family parameter deletion failed.

Autodesk.Revit.DB.FamilyManager.SetDescription(Autodesk.Revit.DB.FamilyParameter,System.String)
Set the description for an existing family parameter.
The description will be used as tooltip in the Revit UI including in the properties palette.
familyParameter: The family parameter.
description: The description of the family parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.
Since: 2015

Autodesk.Revit.DB.FamilyManager.AddParameter(System.String,Autodesk.Revit.DB.BuiltInParameterGroup,Autodesk.Revit.DB.Category,System.Boolean)
Add a new family type parameter to control the type of a nested family within another family.
parameterName: The name of the new family parameter.
parameterGroup: The group to which the family parameter belongs.
familyCategory: The category to which the new family parameter binds.
isInstance: Indicates if the new family parameter is instance or type.
Returns: If creation was successful the new parameter is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method can work even without any family type, but it cannot be assigned the value via
FamilyManager.Set methods when there is no current type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"parameterName"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"parameterName"-is already in use,
or the input parameter group cannot be assigned to the new parameter,
or the input argument-"familyCategory"-is illegal to bind with parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the required family of familyCategory is not existing in current document,
, or when the creation failed.
Or trying to add an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.AddParameter(System.String,Autodesk.Revit.DB.BuiltInParameterGroup,Autodesk.Revit.DB.ParameterType,System.Boolean)
Add a new family parameter with a given name.
parameterName: The name of the new family parameter.
parameterGroup: The group to which the family parameter belongs.
parameterType: The type of new family parameter.
isInstance: Indicates if the new family parameter is instance or type.
Returns: If creation was successful the new parameter is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method can work even without any family type, but it cannot be assigned the value via
FamilyManager.Set methods when there is no current type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"parameterName"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"parameterName"-is already in use,
or when the input argument -"parameterType" is an invalid type,
or the input parameter group cannot be assigned to the new parameter.
Also thrown when "parameterType" is FamilyType; to add a parameter of this type use the AddParameter method that accepts a category instead.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family parameter creation failed.
Or trying to add an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.AddParameter(Autodesk.Revit.DB.ExternalDefinition,Autodesk.Revit.DB.BuiltInParameterGroup,System.Boolean)
Add a new parameter to the family.
Add a new shared parameter to the family.
familyDefinition: The definition of the loaded shared parameter.
isInstance: Indicates if the new parameter is instance or type.
parameterGroup:  The group to which the family parameter belongs.
Returns: If creation was successful the new shared parameter is returned,
otherwise an exception with failure information will be thrown.
Remarks: This method can work even without any family type, but it cannot be assigned the value via
FamilyManager.Set methods when there is no current type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input parameter group cannot be assigned to the new parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the shared family parameter creation is not supported.
Or trying to add an instance parameter of image type.

Autodesk.Revit.DB.FamilyManager.SetValueString(Autodesk.Revit.DB.FamilyParameter,System.String)
Set the string value of a family parameter of the current family type.
familyParameter: The family parameter of current type.
value: The new value string for family parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter" or "value"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is an invalid family parameter.
or the input argument-"value"-is an illegal string.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-"familyParameter"-is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family parameter is determined by formula, or it is not a value type,
or the current family type is invalid.

Autodesk.Revit.DB.FamilyManager.Set(Autodesk.Revit.DB.FamilyParameter,Autodesk.Revit.DB.ElementId)
Set the ElementId value of a family parameter of the current family type.
familyParameter: A family parameter of the current type.
value: The new value for family parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the storage type of family parameter is not ElementId --or-- The input ElementId does not represent either a valid element in the document or InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input ElementId is not valid as a value for this FamilyParameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family parameter is determined by formula,
or the current family type is invalid.

Autodesk.Revit.DB.FamilyManager.Set(Autodesk.Revit.DB.FamilyParameter,System.Double)
Set the double value of a family parameter of the current family type.
familyParameter: A family parameter of the current type.
value: The new value for family parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is an invalid family parameter.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-"familyParameter"-is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family parameter is determined by formula,
or the current family type is invalid.

Autodesk.Revit.DB.FamilyManager.Set(Autodesk.Revit.DB.FamilyParameter,System.String)
Set the string value of a family parameter of the current family type.
familyParameter: A family parameter of the current type.
value: The new value for family parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is an invalid family parameter.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-"familyParameter"-is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family parameter is determined by formula,
or the current family type is invalid.

Autodesk.Revit.DB.FamilyManager.Set(Autodesk.Revit.DB.FamilyParameter,System.Int32)
Set the value of a family parameter of the current family type.
Set the integer value of a family parameter of the current family type.
familyParameter: A family parameter of the current type.
value: The new value for family parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"familyParameter"-is an invalid family parameter.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the input argument-"familyParameter"-is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family parameter is determined by formula,
or the current family type is invalid.

Autodesk.Revit.DB.FamilyManager.Parameter(System.Guid)
Obtains the parameter of this type with a given GUID for a shared parameter.
Remarks: Returns null if the parameter is not found. This method is used to retrieve a family parameter
for a known shared parameter. When a shared parameter is created it is assigned a Guid
which will not change. This guid can be used to retrieve the piece of data from the
element at a later time.

Autodesk.Revit.DB.FamilyManager.Parameter(Autodesk.Revit.DB.Definition)
Obtains the parameter of this type with a given definition.
Remarks: Returns null if the parameter is not found.

Autodesk.Revit.DB.FamilyManager.Parameter(Autodesk.Revit.DB.BuiltInParameter)
Obtains the parameter of this type with a given parameter id.
Remarks: Returns null if the parameter is not found.

Autodesk.Revit.DB.FamilyManager.Parameter(System.String)
Obtains a parameter based on an identifier.
Obtains the parameter of this type with a given name.
Remarks: Returns null if the parameter is not found.

Autodesk.Revit.DB.FamilyManager.Parameters
All family parameters in this family.
Remarks: These parameters will include the 'family parameter', 'shared parameter' and
'builtIn parameter' binding to the family types.
Some parameters might be created as placeholders without a currently assigned value.

Autodesk.Revit.DB.FamilyManager.RenameCurrentType(System.String)
Rename the current family type.
typeName: The new name of the current family type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"typeName"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"typeName"-is already in use.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family type rename failed.

Autodesk.Revit.DB.FamilyManager.DeleteCurrentType
Remove the current family type.
Remarks: If successfully removed, the first available type will become the current type,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when there is only one family type in current document.

Autodesk.Revit.DB.FamilyManager.NewType(System.String)
Add a new family type with a given name and makes it be the current type.
typeName: The name of new family type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"typeName"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"typeName"-is already in use.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family type creation failed.

Autodesk.Revit.DB.FamilyManager.Types
All family types in the family.

Autodesk.Revit.DB.FamilyManager.CurrentType
The current family type.
Remarks: Only the current family type is editable using the methods
in Autodesk.Revit.DB.FamilyManager. If you want to modify the properties of
any family type, it must be set to be the current type first.
This value will be null if there is no type in the family. In order
to modify parameter values, you will need to create one using
Autodesk.Revit.DB.FamilyManager.NewType(System.String).

Autodesk.Revit.DB.FamilyManager
The family manager object to manage the family types and parameters in family document.